; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph4 - mode
	spectrograph1 - mode
	thermograph2 - mode
	thermograph0 - mode
	spectrograph3 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star7 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Phenomenon10 spectrograph3)
	(have_image Planet11 spectrograph4)
	(have_image Star12 thermograph2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph2)
	(have_image Planet15 spectrograph4)
))

)

; plan
1. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet15 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet15)
   goals met: 0 of 7
5. (take_image satellite0 planet15 instrument0 spectrograph4)
   added: (have_image planet15 spectrograph4)
   goals met: 1 of 7
6. (turn_to satellite0 planet11 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet11)
   goals met: 1 of 7
7. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon14 instrument0 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon10 instrument0 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 4 of 7
12. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 4 of 7
13. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon13)
   goals met: 6 of 7
15. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 7 of 7
